nsmlzl/MSP430_FDC2214/main.c
/*
 * main.c
 *
 * Created: 18.11.2017
 * Author : Niklas Schmelzle
 *
 * TODO:
 *
 */

#include <msp430f5529.h>
#include "include/nsi2c.h"

void error();
void redLed();
void greenLed();
void ledOn();
void ledOff();


int main(void){
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer

	// turn LEDs on
	ledOn();

/*
 * testing of own USCI Library
 */
	unsigned char testData[3] = {0x1, 0x1, 0x1};

	for(int i = 0; i < 6; i++){
		nsi_transmit(0x50, 3, testData);
		// wait for write time of EEPROM
		for(int i = 0; i < 160; i++){
			__delay_cycles(1000);
		}
		testData[1]++;
		testData[2]++;
	}

	unsigned char receiveTest[5] = {0x1, 0x1};
	nsi_transmit(0x50, 2, receiveTest);
	for(int i = 0; i < 5; i++){
		receiveTest[i] = 0;
	}
	nsi_receive(0x50, 2, receiveTest);
	nsi_receive(0x50, 2, receiveTest);
	nsi_receive(0x50, 2, receiveTest);

	/*
	while(1){
	}
	*/

	ledOff();
	return 0;
}


// Led function
// Error function turns red LED on
void error(){
	redLed();
}


// Function turns red LED on
void redLed(){
	P1DIR |= 0x1;
	P1OUT |= 0x1;
	P4OUT &= ~(0x1 << 7);
}


// Function turns green LED on
void greenLed(){
	P4DIR |= 0x80;
	P4OUT |= 0x80;
	P1OUT &= ~0x1;
}


// Function turns both LED on
void ledOn(){
	P1DIR |= 0x1;
	P1OUT |= 0x1;
	P4DIR |= 0x80;
	P4OUT |= 0x80;
}


// Function turns both LED off
void ledOff(){
	P1OUT &= ~0x1;
	P4OUT &= ~(0x1 << 7);
}
